[
    {
      "date": "Sep 1",
      "title": "Announcing new partnership between MGH and MyReality DAO to develop amazing games for The Sandbox",
      "text": "The Ethiopians say, “If spiders weave together, they can bind a lion.” That’s why Batman trusted Robin. Bud Spencer only hit it off with Terence Hill — and R2D2 and C-3PO constantly talked past each other...",
      "link": "https://thedac.medium.com/announcing-new-partnership-between-mgh-and-myreality-dao-to-develop-amazing-games-for-the-sandbox-3f1c3daa2515"
    },
    {
      "date": "Sep 7",
      "title": "Presenting The DAC… your one-stop solution to successfully build, launch and scale your DAO",
      "text": "It’s the morning meeting. The CEO steps in and with a sad expression on his face he says: “I’m sorry to tell you this: But we failed — totally.” “WHAT?” The whole team shakes their heads in disbelief. “We’ve not even started!”...",
      "link": "https://thedac.medium.com/presenting-the-dac-your-one-stop-solution-to-successfully-build-launch-and-scale-your-dao-8339d56d2753"
    },
    {
      "date": "Sep 21",
      "title": "Announcing MGH DAO’s Token Generation Event — Making NFTs Accessible to Everyone",
      "text": "Lao Tzu says: “A journey of a thousand miles begins with a single step” And now is the time to make your first step — the first step to stake your NFTs and generate network rewards with them...",
      "link": "https://thedac.medium.com/announcing-mgh-dao-token-sale-the-new-token-to-make-a-passive-income-from-your-nfts-38426dddbe83"
    },
    {
      "date": "Oct 5",
      "title": "This Is The Metaverse on The Blockchain — And How You Can Easily Profit From It Via MGH",
      "text": "Do you know what I mean? — That’s the OASIS. At least, as described by Wade Watts aka Parzival in the movie “Ready Player One.” The OASIS is a universe of virtual planets. In short: the metaverse as you imagine it...",
      "link": "https://thedac.medium.com/this-is-the-metaverse-on-the-blockchain-and-how-you-can-easily-profit-from-it-via-mgh-written-by-b4b8dcf3401d"
    }
  ]
  