[
    {
      "date": "Sep 21",
      "title": "Announcing MGH DAO’s Token Generation Event — Making NFTs Accessible to Everyone",
      "text": "Lao Tzu says: “A journey of a thousand miles begins with a single step” And now is the time to make your first step — the first step to stake your NFTs and generate network rewards with them...",
      "link": "https://thedac.medium.com/announcing-mgh-dao-token-sale-the-new-token-to-make-a-passive-income-from-your-nfts-38426dddbe83"
    },
    {
      "date": "Oct 5",
      "title": "This Is The Metaverse on The Blockchain — And How You Can Easily Profit From It Via MGH",
      "text": "Do you know what I mean? — That’s the OASIS. At least, as described by Wade Watts aka Parzival in the movie “Ready Player One.” The OASIS is a universe of virtual planets. In short: the metaverse as you imagine it...",
      "link": "https://thedac.medium.com/this-is-the-metaverse-on-the-blockchain-and-how-you-can-easily-profit-from-it-via-mgh-written-by-b4b8dcf3401d"
    },
    {
      "date": "Oct 10",
      "title": "The Clock Is Ticking! — Vote Now For MGH’s Ocean Protocol Proposal And Get Fairer Prices For Your Virtual Land",
      "text": "Unfortunately, centralized companies build the pipelines, hold the silos and fill the tankers. But the metaverse should belong to the decentralized community! An important step in that direction is making valuable NFT price data available to the community...",
      "link": "https://thedac.medium.com/the-clock-is-ticking-1054da55f4a8"
    },
    {
      "date": "Oct 15",
      "title": "MetaGameHub Will Launch a Chainlink Node to Bring NFT Valuation Data to Blockchains",
      "text": "MetaGameHub is excited to announce that we will launch an official Chainlink node to bring our NFT valuation data on-chain for decentralized applications (dApps). As the industry-leading secure blockchain middleware, Chainlink enables existing APIs to easily become compatible with leading blockchains...",
      "link": "https://thedac.medium.com/metagamehub-will-launch-a-chainlink-node-to-bring-nft-valuation-data-to-blockchains-af50b70e2f04"
    }
  ]
  