[
    {
      "date": "Dec 01",
      "title": "Earn Additional Rewards from the Metaverse! — MGH Staking Is Live with Lavish Rewards",
      "text": "Working virtually, attending every concert in the world, a digital Facebook founder on a surfboard... Marc Zuckerberg announced a lot when he introduced Meta on Connect. What he didn’t announce, however, is something that only a DECENTRALIZED Metaverse can dish out: generous Network Rewards via staking...",
      "link": "https://metagamehub.medium.com/earn-additional-rewards-from-the-metaverse-mgh-staking-is-live-with-lavish-rewards-334dc54b2bbd"
    },
    {
      "date": "Dec 15",
      "title": "MGH Staking on Ethereum",
      "text": "The time has come to stake your MGH on the Ethereum Network. We are ready to present what you need to know about our staking mechanism...",
      "link": "https://metagamehub.medium.com/mgh-staking-on-ethereum-4f3bfe01005c"
    },
    {
      "date": "Dec 16",
      "title": "The MetaGameHub Chainlink Node Is Live, Making The Sandbox and Decentraland Land Title Prices Available On-Chain",
      "text": "We are excited to announce that MetaGameHub DAO has launched its official Chainlink node live on mainnet. Our Chainlink node will make NFT valuation data available directly on-chain for use by decentralized applications (dApps), as well as cryptographically sign the data to prove it originated from MGH...",
      "link": "https://metagamehub.medium.com/the-metagamehub-chainlink-node-is-live-making-the-sandbox-and-decentraland-land-title-prices-2490ce929389"
    },
    {
      "date": "Jan 03",
      "title": "Need a Loan on Your Sandbox LAND? — New Partnership Between Zharta and MGH Will Make That Possible",
      "text": "Your LAND in The Sandbox. You’ve spent hours designing it — you built houses, sprinkled it with trees, populated it with figurines… And now you have no choice but to sell it. Because you desperately need money. But do you really have to? Isn’t there some way to hold on...",
      "link": "https://metagamehub.medium.com/need-a-loan-on-your-sandbox-land-new-partnership-between-zharta-and-mgh-will-make-that-possible-127c069a28d3"
    }
  ]
  