[
    {
      "date": "Nov 08",
      "title": "MGH and NFT Artists — Have You Ever Seen Such a Cute NFT Dog from Outer Space?",
      "text": "Caution: Do not pet her! Don’t expect her to be nice. She won’t wag her tail. Nor will she jump on your lap. After all, she’s walked all over the universe… and seen things, mysterious, hair-raising, harrowing things. If you get too close, she might lick your fingers with her...",
      "link": "https://metagamehub.medium.com/mgh-and-nft-artists-have-you-ever-seen-such-a-cute-nft-dog-from-outer-space-5fa2792df927"
    },
    {
      "date": "Nov 11",
      "title": "Blockchain Oracles Explained — A Simple Guide on How to Get Data on the Blockchain",
      "text": "Let’s start with a brief story, so you understand oracles right away: In 1862, a race began in the United States. Two railroads — Union Pacific and Central Pacific — were to connect the East and West Coast. Central came from the west...",
      "link": "https://metagamehub.medium.com/blockchain-oracles-explained-a-simple-guide-on-how-to-get-data-on-the-blockchain-fb86da7b26e4"
    },
    {
      "date": "Nov 12",
      "title": "Last Chance to Get Your MGH Tokens at a Fixed Price — MGH Public Membership Round 3!",
      "text": "“Chances are like sunsets — when one set, the next one will come soon.” A nice saying… but eventually the last chance comes where you look in vain for the sun. It remains dark. Such a last chance is coming for you — for the last...",
      "link": "https://metagamehub.medium.com/last-chance-to-get-your-mgh-tokens-at-a-fixed-price-mgh-public-membership-round-3-6eeef8e6b3b0"
    },
    {
      "date": "Nov 14",
      "title": "Beginners Guide: How to buy $MGH on Uniswap V3",
      "text": "On the day of writing (14.11.21), MetaGameHub DAO launched its future utility token ($MGH) on Uniswap V3! Since MGH strives to make NFTs accessible to anyone having access to a blockchain network, we want to make sure anyone knows how to get MGH...",
      "link": "https://metagamehub.medium.com/beginners-guide-how-to-buy-mgh-on-uniswap-v3-f8795a4deff0"
    }
  ]
  