[
    {
      "date": "Oct 10",
      "title": "The Clock Is Ticking! — Vote Now For MGH’s Ocean Protocol Proposal And Get Fairer Prices For Your Virtual Land",
      "text": "Unfortunately, centralized companies build the pipelines, hold the silos and fill the tankers. But the metaverse should belong to the decentralized community! An important step in that direction is making valuable NFT price data available to the community...",
      "link": "https://thedac.medium.com/the-clock-is-ticking-1054da55f4a8"
    },
    {
      "date": "Oct 14",
      "title": "MetaGameHub Will Launch a Chainlink Node to Bring NFT Valuation Data to Blockchains",
      "text": "MetaGameHub is excited to announce that we will launch an official Chainlink node to bring our NFT valuation data on-chain for decentralized applications (dApps). As the industry-leading secure blockchain middleware, Chainlink enables existing APIs to easily become compatible with leading blockchains...",
      "link": "https://thedac.medium.com/metagamehub-will-launch-a-chainlink-node-to-bring-nft-valuation-data-to-blockchains-af50b70e2f04"
    },
    {
      "date": "Oct 25",
      "title": "MGH and Amazing Blocks form a partnership to explore the frontiers of DeFi and the metaverse",
      "text": "The new world. How do you connect it to the old? How do you sell your house in the next Ethereum block? Display your machines on the blockchain? Or start a company with ETH as seed capital — and not with dull dollars?...",
      "link": "https://metagamehub.medium.com/mgh-and-amazing-blocks-form-a-partnership-to-explore-the-frontiers-of-defi-and-the-metaverse-6981db73ee32"
    },
    {
      "date": "Nov 02",
      "title": "How Much Is Your LAND from the Sandbox Really Worth? — Find out Now with the Free Tool from MGH!",
      "text": "It’s frustrating! You buy LAND — e .g. in The Sandbox — but you don’t know what it’s really worth. Of course, you have hope — hope that the price will go up afterward. Plus, FOMO — did I still get in on time? And emotions — anger, panic, euphoria as prices spin like a weather vane....",
      "link": "https://metagamehub.medium.com/how-much-is-your-land-from-the-sandbox-really-worth-find-out-now-with-the-free-tool-from-mgh-d8d3bdc46294"
    }
  ]
  